export const labs = [
  {
    "name": "Warcraft",
    "description": "Заданное количество юнитов добывают золото равными порциями из одной шахты, задерживаясь в пути на случайное время, до ее истощения. Работа каждого юнита реализуется в порожденном процессе потоке."
  },
  {
    "name": "Graphics",
    "description": "Написать Windows-приложение, которое выполняет анимацию изображения. Создать меню с командами Show picture, Choose, Animate, Stop, Quit. Команда Quit завершает работу приложения. При выборе команды Show picture в центре экрана рисуется объект, состоящий из нескольких графических примитивов. По команде Animate объект начинает перемещаться в выбранном направлении до края окна и обратно с заданной скоростью, по команде Stop — прекращает движение."
  },
  {
    "name": "Matrix",
    "description": "Создать Windows-приложение в таблице, которое по запрашиваемому количеству строк и столбцов формирует случайным образом двумерный массив А, подсчитывает количество четных элементов по столбцам получившейся матрицы, полученные результаты заносит в одномерный массив В и сортирует массив."
  },
  {
    "name": "Messenger",
    "description": "На базе примера написать чат. Программа должна передавать самой себе по VinSocket сообщения в обычном и кодированном виде. Использовать код Цезаря. Суть кода: все буквы сдвинуты на три позиции, то есть: «а» шифруется буквой «г», «б»—«д» и так далее, «э»—«а», «ю»—«б», «я»—«в». Аналогично сдвигается английский алфавит."
  }
];
